Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.inspector.plan.help.contextBudget.field.reservedOutput
source: Reserved output: tokens set aside for the model reply; not counted in the usage percentage.
ar: الإخراج المحجوز: رموز مخصصة لرد النموذج؛ لا تُحتسب في نسبة الاستخدام.
de: Reservierte Ausgabe: Tokens, die für die Modellantwort zurückgehalten werden; nicht im Nutzungsprozentsatz enthalten.
es: Salida reservada: tokens reservados para la respuesta del modelo; no se cuentan en el porcentaje de uso.
fr: Sortie réservée : jetons réservés pour la réponse du modèle ; non comptés dans le pourcentage d'utilisation.
id: Keluaran yang dicadangkan: token yang disisihkan untuk balasan model; tidak dihitung dalam persentase penggunaan.
it: Output riservato: token riservati per la risposta del modello; non conteggiati nella percentuale di utilizzo.
ja: 予約出力: モデルの応答用に確保されたトークン。使用率にはカウントされません。
ko: 예약된 출력: 모델 응답을 위해 할당된 토큰으로, 사용 비율에 포함되지 않습니다.
nl: Gereserveerde uitvoer: tokens die zijn gereserveerd voor het modelantwoord; niet meegeteld in het gebruikspercentage.
pl: Zarezerwowane wyjście: tokeny przeznaczone na odpowiedź modelu; nie wliczane do procentu użycia.
pt_br: Saída reservada: tokens reservados para a resposta do modelo; não contam na porcentagem de uso.
ru: Зарезервированный вывод: токены, отведённые для ответа модели; не учитываются в процентах использования.
tr: Ayrılmış çıktı: model yanıtı için ayrılan token'lar; kullanım yüzdesine dahil edilmez.
uk: Зарезервоване виведення: токени, відведені для відповіді моделі; не враховуються у відсотку використання.
vi: Đầu ra dự trữ: token dành riêng cho phản hồi của mô hình; không được tính vào tỷ lệ sử dụng.
zh_hans: 预留输出：为模型回答保留的分片；不计入顶部占用百分比。
zh_hant: 預留輸出：為模型回答保留的分片；不計入頂部佔用百分比。

# rag.workspace.inspector.plan.help.contextBudget.field.segments
source: Input segments: system, history, question, evidence, remote content, and attachments.
ar: أجزاء الإدخال: النظام، السجل، السؤال، الأدلة، المحتوى البعيد، والمرفقات.
de: Eingabeabschnitte: System, Verlauf, Frage, Belege, Remote-Inhalte und Anhänge.
es: Segmentos de entrada: sistema, historial, pregunta, evidencia, contenido remoto y archivos adjuntos.
fr: Segments d'entrée : système, historique, question, preuves, contenu distant et pièces jointes.
id: Segmen masukan: sistem, riwayat, pertanyaan, bukti, konten jarak jauh, dan lampiran.
it: Segmenti di input: sistema, cronologia, domanda, evidenze, contenuto remoto e allegati.
ja: 入力セグメント: システム、履歴、質問、証拠、リモートコンテンツ、添付ファイル。
ko: 입력 세그먼트: 시스템, 기록, 질문, 증거, 원격 콘텐츠 및 첨부 파일.
nl: Invoersegmenten: systeem, geschiedenis, vraag, bewijs, externe inhoud en bijlagen.
pl: Segmenty wejściowe: system, historia, pytanie, dowody, treści zdalne i załączniki.
pt_br: Segmentos de entrada: sistema, histórico, pergunta, evidências, conteúdo remoto e anexos.
ru: Входные сегменты: система, история, вопрос, доказательства, удалённый контент и вложения.
tr: Giriş bölümleri: sistem, geçmiş, soru, kanıt, uzak içerik ve ekler.
uk: Сегменти введення: система, історія, питання, докази, віддалений вміст і вкладення.
vi: Phân đoạn đầu vào: hệ thống, lịch sử, câu hỏi, bằng chứng, nội dung từ xa và tệp đính kèm.
zh_hans: 输入分片：系统提示、历史、问题、证据、远程内容与附件。
zh_hant: 輸入分片：系統提示、歷史、問題、證據、遠端內容與附件。

# rag.workspace.inspector.plan.help.contextBudget.field.window
source: Window total: the configured context window for the selected model.
ar: إجمالي النافذة: نافذة السياق المكونة للنموذج المحدد.
de: Fenstergröße: das konfigurierte Kontextfenster für das ausgewählte Modell.
es: Total de la ventana: la ventana de contexto configurada para el modelo seleccionado.
fr: Total de la fenêtre : la fenêtre de contexte configurée pour le modèle sélectionné.
id: Total jendela: jendela konteks yang dikonfigurasi untuk model yang dipilih.
it: Totale finestra: la finestra di contesto configurata per il modello selezionato.
ja: ウィンドウ合計: 選択したモデルに設定されたコンテキストウィンドウ。
ko: 창 총합: 선택한 모델에 대해 구성된 컨텍스트 창입니다.
nl: Venstertotaal: het geconfigureerde contextvenster voor het geselecteerde model.
pl: Całkowite okno: skonfigurowane okno kontekstu dla wybranego modelu.
pt_br: Total da janela: a janela de contexto configurada para o modelo selecionado.
ru: Общий размер окна: настроенное окно контекста для выбранной модели.
tr: Pencere toplamı: seçilen model için yapılandırılmış bağlam penceresi.
uk: Загальний розмір вікна: налаштоване вікно контексту для вибраної моделі.
vi: Tổng cửa sổ: cửa sổ ngữ cảnh đã cấu hình cho mô hình đã chọn.
zh_hans: 窗口总量：当前所选模型配置的 Context Window 上限。
zh_hant: 視窗總量：當前所選模型配置的 Context Window 上限。

# rag.workspace.inspector.plan.help.contextBudget.fields.title
source: Fields in this section
ar: الحقول في هذا القسم
de: Felder in diesem Abschnitt
es: Campos en esta sección
fr: Champs de cette section
id: Bidang di bagian ini
it: Campi in questa sezione
ja: このセクションのフィールド
ko: 이 섹션의 필드
nl: Velden in deze sectie
pl: Pola w tej sekcji
pt_br: Campos nesta seção
ru: Поля в этом разделе
tr: Bu bölümdeki alanlar
uk: Поля цього розділу
vi: Các trường trong phần này
zh_hans: 本节字段含义
zh_hant: 本節欄位含義

# rag.workspace.inspector.plan.help.contextBudget.open
source: Learn about context budget
ar: تعلّم حول ميزانية السياق
de: Mehr über das Kontextbudget erfahren
es: Más información sobre el presupuesto de contexto
fr: En savoir plus sur le budget de contexte
id: Pelajari tentang anggaran konteks
it: Scopri il budget di contesto
ja: コンテキスト予算について
ko: 컨텍스트 예산 알아보기
nl: Meer over contextbudget
pl: Dowiedz się o budżecie kontekstu
pt_br: Saiba mais sobre orçamento de contexto
ru: Узнать о бюджете контекста
tr: Bağlam bütçesi hakkında bilgi edinin
uk: Дізнатися про бюджет контексту
vi: Tìm hiểu về ngân sách ngữ cảnh
zh_hans: 了解上下文预算
zh_hant: 了解上下文預算

# rag.workspace.inspector.plan.help.contextBudget.title
source: Context budget
ar: ميزانية السياق
de: Kontextbudget
es: Presupuesto de contexto
fr: Budget de contexte
id: Anggaran konteks
it: Budget di contesto
ja: コンテキスト予算
ko: 컨텍스트 예산
pl: Budżet kontekstu
pt_br: Orçamento de contexto
ru: Бюджет контекста
tr: Bağlam bütçesi
uk: Бюджет контексту
vi: Ngân sách ngữ cảnh
zh_hans: 上下文预算
zh_hant: 上下文預算

# rag.workspace.inspector.plan.help.executionStrategy.definition.body
source: How Starcat will query your local knowledge base: execution mode, repository filters, sorting, and optional structured analytics. This is the Planner's local retrieval plan.
ar: كيف ستستعلم Starcat قاعدة معارفك المحلية: وضع التنفيذ، عوامل تصفية المستودعات، الترتيب، والتحليلات المنظمة الاختيارية. هذه هي خطة الاسترجاع المحلية للمخطط.
de: Wie Starcat Ihre lokale Wissensbasis abfragt: Ausführungsmodus, Repository-Filter, Sortierung und optionale strukturierte Analysen. Dies ist der lokale Abrufplan des Planners.
es: Cómo Starcat consultará su base de conocimiento local: modo de ejecución, filtros de repositorio, ordenación y analíticas estructuradas opcionales. Este es el plan de recuperación local del planificador.
fr: Comment Starcat interrogera votre base de connaissances locale : mode d'exécution, filtres de dépôt, tri et analytiques structurées optionnelles. C'est le plan de récupération local du planificateur.
id: Bagaimana Starcat akan menanyai basis pengetahuan lokal Anda: mode eksekusi, filter repositori, pengurutan, dan analitik terstruktur opsional. Ini adalah rencana pengambilan lokal Planner.
it: Come Starcat interrogherà la tua knowledge base locale: modalità di esecuzione, filtri repository, ordinamento e analisi strutturata opzionale. Questo è il piano di recupero locale del Planner.
ja: Starcatがローカル知識ベースをクエリする方法: 実行モード、リポジトリフィルタ、並び替え、オプションの構造化分析。これはプランナーのローカル検索計画です。
ko: Starcat이 로컬 지식 베이스를 쿼리하는 방법: 실행 모드, 저장소 필터, 정렬 및 선택적 구조화된 분석입니다. 이는 Planner의 로컬 검색 계획입니다.
nl: Hoe Starcat je lokale kennisbank doorzoekt: uitvoeringsmodus, repositoryfilters, sortering en optionele gestructureerde analyses. Dit is het lokale ophaalplan van de Planner.
pl: Jak Starcat będzie przeszukiwać lokalną bazę wiedzy: tryb wykonania, filtry repozytoriów, sortowanie i opcjonalna analityka strukturalna. To lokalny plan wyszukiwania Planisty.
pt_br: Como o Starcat consultará sua base de conhecimento local: modo de execução, filtros de repositório, ordenação e análise estruturada opcional. Este é o plano de recuperação local do Planejador.
ru: Как Starcat будет запрашивать вашу локальную базу знаний: режим выполнения, фильтры репозиториев, сортировка и опциональная структурированная аналитика. Это локальный план поиска планировщика.
tr: Starcat'ın yerel bilgi tabanınızı nasıl sorgulayacağı: yürütme modu, depo filtreleri, sıralama ve isteğe bağlı yapılandırılmış analitik. Bu, Planlayıcı'nın yerel getirme planıdır.
uk: Як Starcat запитуватиме вашу локальну базу знань: режим виконання, фільтри репозиторіїв, сортування та додаткова структурована аналітика. Це локальний план пошуку планувальника.
vi: Cách Starcat sẽ truy vấn cơ sở tri thức cục bộ của bạn: chế độ thực thi, bộ lọc kho lưu trữ, sắp xếp và phân tích có cấu trúc tùy chọn. Đây là kế hoạch truy xuất cục bộ của Planner.
zh_hans: Starcat 如何在本地知识库中检索：执行模式、仓库筛选、排序，以及可选的结构化统计。这是 Planner 给出的本地检索方案。
zh_hant: Starcat 如何在本地知識庫中檢索：執行模式、倉庫篩選、排序，以及可選的結構化統計。這是 Planner 給出的本地檢索方案。

# rag.workspace.inspector.plan.help.executionStrategy.definition.title
source: What is execution strategy?
ar: ما هي استراتيجية التنفيذ؟
de: Was ist die Ausführungsstrategie?
es: ¿Qué es la estrategia de ejecución?
fr: Qu'est-ce que la stratégie d'exécution ?
id: Apa itu strategi eksekusi?
it: Cos'è la strategia di esecuzione?
ja: 実行戦略とは？
ko: 실행 전략이란 무엇인가요?
nl: Wat is uitvoeringsstrategie?
pl: Co to jest strategia wykonania?
pt_br: O que é estratégia de execução?
ru: Что такое стратегия выполнения?
tr: Yürütme stratejisi nedir?
uk: Що таке стратегія виконання?
vi: Chiến lược thực thi là gì?
zh_hans: 执行策略是什么？
zh_hant: 什麼是執行策略？

# rag.workspace.inspector.plan.help.executionStrategy.field.analytics
source: Analytics: optional structured aggregation over metadata (count, top-N, averages).
ar: التحليلات: تجميع منظم اختياري عبر البيانات الوصفية (العدد، أعلى-ن، المتوسطات).
de: Analysen: optionale strukturierte Aggregation über Metadaten (Anzahl, Top-N, Durchschnitte).
es: Analíticas: agregación estructurada opcional sobre metadatos (conteo, top-N, promedios).
fr: Analytiques : agrégation structurée optionnelle sur les métadonnées (nombre, top-N, moyennes).
id: Analitik: agregasi terstruktur opsional atas metadata (jumlah, N teratas, rata-rata).
it: Analisi: aggregazione strutturata opzionale sui metadati (conteggio, top-N, medie).
ja: 分析: メタデータに対するオプションの構造化集約（カウント、トップN、平均など）。
ko: 분석: 메타데이터에 대한 선택적 구조화된 집계(개수, 상위 N, 평균)입니다.
nl: Analyses: optionele gestructureerde aggregatie over metadata (aantal, top-N, gemiddelden).
pl: Analityka: opcjonalna agregacja strukturalna metadanych (liczba, top-N, średnie).
pt_br: Análise: agregação estruturada opcional sobre metadados (contagem, top-N, médias).
ru: Аналитика: опциональная структурированная агрегация по метаданным (количество, топ-N, средние значения).
tr: Analitik: meta veriler üzerinde isteğe bağlı yapılandırılmış toplama (sayı, en iyi-N, ortalamalar).
uk: Аналітика: додаткова структурована агрегація метаданих (кількість, топ-N, середні значення).
vi: Phân tích: tổng hợp có cấu trúc tùy chọn trên siêu dữ liệu (số lượng, top-N, trung bình).
zh_hans: 结构化分析：对元数据做聚合统计（计数、Top-N、均值等）。
zh_hant: 結構化分析：對元數據做聚合統計（計數、Top-N、均值等）。

# rag.workspace.inspector.plan.help.executionStrategy.field.candidateLimit
source: Candidate limit: maximum repositories entering the retrieval funnel.
ar: حد المرشحين: الحد الأقصى للمستودعات التي تدخل قمع الاسترجاع.
de: Kandidatenlimit: maximale Anzahl von Repositories, die in den Abruftrichter gelangen.
es: Límite de candidatos: número máximo de repositorios que entran en el embudo de recuperación.
fr: Limite de candidats : nombre maximum de dépôts entrant dans l'entonnoir de récupération.
id: Batas kandidat: jumlah maksimum repositori yang memasuki corong pengambilan.
it: Limite candidati: numero massimo di repository che entrano nell'imbuto di recupero.
ja: 候補制限: 検索ファネルに入る最大リポジトリ数。
ko: 후보 제한: 검색 깔때기에 진입하는 최대 저장소 수입니다.
nl: Kandidaatlimiet: maximaal aantal repositories dat de ophaaltrechter ingaat.
pl: Limit kandydatów: maksymalna liczba repozytoriów wchodzących do lejka wyszukiwania.
pt_br: Limite de candidatos: número máximo de repositórios que entram no funil de recuperação.
ru: Лимит кандидатов: максимальное количество репозиториев, попадающих в воронку поиска.
tr: Aday limiti: getirme hunisine giren maksimum depo sayısı.
uk: Ліміт кандидатів: максимальна кількість репозиторіїв, що потрапляють у вирву пошуку.
vi: Giới hạn ứng viên: số lượng kho lưu trữ tối đa đi vào kênh truy xuất.
zh_hans: 候选上限：进入检索漏斗的仓库数量上限。
zh_hant: 候選上限：進入檢索漏斗的倉庫數量上限。

# rag.workspace.inspector.plan.help.executionStrategy.field.filters
source: Filters: repository constraints inferred from your question (language, stars, tags, etc.).
ar: عوامل التصفية: قيود المستودعات المستنتجة من سؤالك (اللغة، النجوم، الوسوم، إلخ).
de: Filter: Repository-Einschränkungen, die aus Ihrer Frage abgeleitet werden (Sprache, Sterne, Tags usw.).
es: Filtros: restricciones de repositorio inferidas de su pregunta (idioma, estrellas, etiquetas, etc.).
fr: Filtres : contraintes de dépôt déduites de votre question (langue, étoiles, étiquettes, etc.).
id: Filter: batasan repositori yang disimpulkan dari pertanyaan Anda (bahasa, bintang, tag, dll.).
it: Filtri: vincoli sui repository dedotti dalla tua domanda (linguaggio, stelle, tag, ecc.).
ja: フィルタ: 質問から推測されるリポジトリ制約（言語、スター数、タグなど）。
ko: 필터: 질문에서 추론된 저장소 제약 조건(언어, 별표, 태그 등)입니다.
nl: Filters: repositorybeperkingen afgeleid uit je vraag (taal, sterren, tags, enz.).
pl: Filtry: ograniczenia repozytoriów wywnioskowane z pytania (język, gwiazdki, tagi itp.).
pt_br: Filtros: restrições de repositório inferidas da sua pergunta (idioma, estrelas, etiquetas, etc.).
ru: Фильтры: ограничения по репозиториям, выведенные из вашего вопроса (язык, звёзды, теги и т.д.).
tr: Filtreler: sorunuzdan çıkarılan depo kısıtlamaları (dil, yıldız, etiket vb.).
uk: Фільтри: обмеження репозиторіїв, визначені з вашого питання (мова, зірки, теги тощо).
vi: Bộ lọc: ràng buộc kho lưu trữ được suy ra từ câu hỏi của bạn (ngôn ngữ, sao, thẻ, v.v.).
zh_hans: 筛选条件：Planner 从问题推断的仓库约束（语言、Star 数、标签等）。
zh_hant: 篩選條件：Planner 從問題推斷的倉庫約束（語言、Star 數、標籤等）。

# rag.workspace.inspector.plan.help.executionStrategy.field.mode
source: Plan mode: semantic-only, filtered semantic, structured-only, or guided discovery.
ar: وضع الخطة: دلالي فقط، دلالي مفلتر، منظم فقط، أو اكتشاف موجه.
de: Planmodus: nur semantisch, gefiltert semantisch, nur strukturiert oder geführte Entdeckung.
es: Modo de plan: solo semántico, semántico filtrado, solo estructurado o descubrimiento guiado.
fr: Mode de plan : sémantique uniquement, sémantique filtré, structuré uniquement ou découverte guidée.
id: Mode rencana: semantik saja, semantik terfilter, terstruktur saja, atau penemuan terpandu.
it: Modalità piano: solo semantico, semantico filtrato, solo strutturato o scoperta guidata.
ja: 計画モード: セマンティックのみ、フィルタリングセマンティック、構造化のみ、またはガイド付き発見。
ko: 계획 모드: 의미론적 전용, 필터링된 의미론적, 구조화 전용 또는 안내된 검색입니다.
nl: Planmodus: alleen semantisch, gefilterd semantisch, alleen gestructureerd of begeleide ontdekking.
pl: Tryb planu: tylko semantyczny, filtrowany semantyczny, tylko strukturalny lub odkrywanie kierowane.
pt_br: Modo do plano: somente semântico, semântico filtrado, somente estruturado ou descoberta guiada.
ru: Режим плана: только семантический, фильтрованный семантический, только структурированный или управляемое обнаружение.
tr: Plan modu: yalnızca anlamsal, filtrelenmiş anlamsal, yalnızca yapılandırılmış veya yönlendirmeli keşif.
uk: Режим плану: лише семантичний, фільтрований семантичний, лише структурований або кероване дослідження.
vi: Chế độ kế hoạch: chỉ ngữ nghĩa, ngữ nghĩa có lọc, chỉ cấu trúc hoặc khám phá có hướng dẫn.
zh_hans: 计划模式：纯语义、带过滤语义、仅结构化，或引导发现。
zh_hant: 計劃模式：純語義、帶過濾語義、僅結構化，或引導發現。

# rag.workspace.inspector.plan.help.executionStrategy.field.sort
source: Sort: how candidate repositories are ordered before retrieval.
ar: الترتيب: كيفية ترتيب المستودعات المرشحة قبل الاسترجاع.
de: Sortierung: wie die Kandidaten-Repositories vor dem Abruf geordnet werden.
es: Orden: cómo se ordenan los repositorios candidatos antes de la recuperación.
fr: Tri : comment les dépôts candidats sont ordonnés avant la récupération.
id: Urutkan: bagaimana repositori kandidat diurutkan sebelum pengambilan.
it: Ordinamento: come vengono ordinati i repository candidati prima del recupero.
ja: 並び替え: 検索前に候補リポジトリをどのように順序付けるか。
ko: 정렬: 검색 전 후보 저장소의 순서 지정 방식입니다.
nl: Sortering: hoe kandidaatrepositories worden geordend voor het ophalen.
pl: Sortowanie: sposób porządkowania repozytoriów kandydatów przed wyszukiwaniem.
pt_br: Ordenação: como os repositórios candidatos são ordenados antes da recuperação.
ru: Сортировка: порядок кандидатов перед поиском.
tr: Sıralama: aday depoların getirmeden önce nasıl sıralanacağı.
uk: Сортування: як кандидати репозиторіїв упорядковуються перед пошуком.
vi: Sắp xếp: cách các kho lưu trữ ứng viên được sắp xếp trước khi truy xuất.
zh_hans: 排序：检索前候选仓库的排列方式。
zh_hant: 排序：檢索前候選倉庫的排列方式。

# rag.workspace.inspector.plan.help.executionStrategy.fields.title
source: Fields in this section
ar: الحقول في هذا القسم
de: Felder in diesem Abschnitt
es: Campos en esta sección
fr: Champs de cette section
id: Bidang di bagian ini
it: Campi in questa sezione
ja: このセクションのフィールド
ko: 이 섹션의 필드
nl: Velden in deze sectie
pl: Pola w tej sekcji
pt_br: Campos nesta seção
ru: Поля в этом разделе
tr: Bu bölümdeki alanlar
uk: Поля цього розділу
vi: Các trường trong phần này
zh_hans: 本节字段含义
zh_hant: 本節欄位含義

# rag.workspace.inspector.plan.help.executionStrategy.open
source: Learn about execution strategy
ar: تعلّم حول استراتيجية التنفيذ
de: Mehr über die Ausführungsstrategie erfahren
es: Más información sobre la estrategia de ejecución
fr: En savoir plus sur la stratégie d'exécution
id: Pelajari tentang strategi eksekusi
it: Scopri la strategia di esecuzione
ja: 実行戦略について
ko: 실행 전략 알아보기
nl: Meer over uitvoeringsstrategie
pl: Dowiedz się o strategii wykonania
pt_br: Saiba mais sobre estratégia de execução
ru: Узнать о стратегии выполнения
tr: Yürütme stratejisi hakkında bilgi edinin
uk: Дізнатися про стратегію виконання
vi: Tìm hiểu về chiến lược thực thi
zh_hans: 了解执行策略
zh_hant: 了解執行策略

# rag.workspace.inspector.plan.help.executionStrategy.title
source: Execution strategy
ar: استراتيجية التنفيذ
de: Ausführungsstrategie
es: Estrategia de ejecución
fr: Stratégie d'exécution
id: Strategi eksekusi
it: Strategia di esecuzione
ja: 実行戦略
ko: 실행 전략
nl: Uitvoeringsstrategie
pl: Strategia wykonania
pt_br: Estratégia de execução
ru: Стратегия выполнения
tr: Yürütme stratejisi
uk: Стратегія виконання
vi: Chiến lược thực thi
zh_hans: 执行策略
zh_hant: 執行策略

# rag.workspace.inspector.plan.help.networkPlan.definition.body
source: Whether live external evidence is needed and what Starcat will fetch from GitHub or the public web. Shown only when the Planner requests network access.
ar: ما إذا كانت هناك حاجة إلى أدلة خارجية مباشرة وما ستجلبه Starcat من GitHub أو الويب العام. يظهر فقط عندما يطلب المخطط الوصول إلى الشبكة.
de: Ob externe Live-Belege benötigt werden und was Starcat von GitHub oder dem öffentlichen Web abruft. Wird nur angezeigt, wenn der Planner Netzwerkzugriff anfordert.
es: Si se necesita evidencia externa en vivo y qué obtendrá Starcat de GitHub o la web pública. Se muestra solo cuando el planificador solicita acceso a la red.
fr: Si des preuves externes en direct sont nécessaires et ce que Starcat récupérera depuis GitHub ou le web public. Affiché uniquement lorsque le planificateur demande un accès réseau.
id: Apakah bukti eksternal langsung diperlukan dan apa yang akan diambil Starcat dari GitHub atau web publik. Hanya ditampilkan saat Planner meminta akses jaringan.
it: Se sono necessarie evidenze esterne in tempo reale e cosa Starcat recupererà da GitHub o dal web pubblico. Mostrato solo quando il Planner richiede accesso alla rete.
ja: ライブの外部証拠が必要かどうか、およびStarcatがGitHubや公開Webから何を取得するか。プランナーがネットワークアクセスを要求した場合のみ表示されます。
ko: 실시간 외부 증거가 필요한지 여부와 Starcat이 GitHub 또는 공개 웹에서 가져올 내용입니다. Planner가 네트워크 액세스를 요청할 때만 표시됩니다.
nl: Of er live externe bewijs nodig is en wat Starcat van GitHub of het openbare web ophaalt. Alleen getoond wanneer de Planner netwerktoegang aanvraagt.
pl: Czy potrzebne są zewnętrzne dowody na żywo i co Starcat pobierze z GitHuba lub publicznego internetu. Wyświetlane tylko wtedy, gdy Planista zażąda dostępu do sieci.
pt_br: Se é necessária evidência externa ao vivo e o que o Starcat buscará no GitHub ou na web pública. Exibido apenas quando o Planejador solicita acesso à rede.
ru: Нужны ли живые внешние данные и что Starcat будет загружать из GitHub или публичного веба. Показывается только когда планировщик запрашивает сетевой доступ.
tr: Canlı harici kanıtın gerekli olup olmadığı ve Starcat'ın GitHub'dan veya genel web'den ne getireceği. Yalnızca Planlayıcı ağ erişimi istediğinde gösterilir.
uk: Чи потрібні живі зовнішні докази, і що Starcat отримає з GitHub або публічного вебу. Показується лише тоді, коли планувальник запитує доступ до мережі.
vi: Liệu có cần bằng chứng trực tiếp từ bên ngoài hay không và Starcat sẽ tìm nạp gì từ GitHub hoặc web công cộng. Chỉ hiển thị khi Planner yêu cầu truy cập mạng.
zh_hans: 是否需要拉取实时外部证据，以及将从 GitHub 或公开互联网获取什么。仅在 Planner 请求联网时出现。
zh_hant: 是否需要拉取即時外部證據，以及將從 GitHub 或公開網際網路獲取什麼。僅在 Planner 請求聯網時出現。

# rag.workspace.inspector.plan.help.networkPlan.definition.title
source: What is network plan?
ar: ما هي خطة الشبكة؟
de: Was ist der Netzwerkplan?
es: ¿Qué es el plan de red?
fr: Qu'est-ce que le plan réseau ?
id: Apa itu rencana jaringan?
it: Cos'è il piano di rete?
ja: ネットワーク計画とは？
ko: 네트워크 계획이란 무엇인가요?
nl: Wat is netwerkplan?
pl: Co to jest plan sieciowy?
pt_br: O que é plano de rede?
ru: Что такое сетевой план?
tr: Ağ planı nedir?
uk: Що таке мережевий план?
vi: Kế hoạch mạng là gì?
zh_hans: 联网计划是什么？
zh_hant: 什麼是聯網計劃？

# rag.workspace.inspector.plan.help.networkPlan.field.liveEvidence
source: Live context: whether stale local chunks are insufficient and network fetch is required.
ar: السياق المباشر: ما إذا كانت الأجزاء المحلية القديمة غير كافية ويلزم جلب الشبكة.
de: Live-Kontext: ob veraltete lokale Blöcke nicht ausreichen und ein Netzwerkabruf erforderlich ist.
es: Contexto en vivo: si los fragmentos locales desactualizados son insuficientes y se requiere recuperación de red.
fr: Contexte en direct : si les morceaux locaux obsolètes sont insuffisants et qu'une récupération réseau est nécessaire.
id: Konteks langsung: apakah potongan lokal yang basi tidak mencukupi dan pengambilan jaringan diperlukan.
it: Contesto live: se i chunk locali obsoleti sono insufficienti e è necessario il recupero dalla rete.
ja: ライブコンテキスト: 古いローカルチャンクで不十分でネットワーク取得が必要かどうか。
ko: 실시간 컨텍스트: 오래된 로컬 청크가 충분하지 않아 네트워크 가져오기가 필요한지 여부입니다.
nl: Live context: of verouderde lokale chunks onvoldoende zijn en netwerkophalen nodig is.
pl: Kontekst na żywo: czy lokalne fragmenty są nieaktualne i wymagane jest pobranie z sieci.
pt_br: Contexto ao vivo: se os fragmentos locais desatualizados são insuficientes e é necessária uma busca na rede.
ru: Живой контекст: достаточно ли устаревших локальных фрагментов или требуется сетевая загрузка.
tr: Canlı bağlam: eski yerel parçaların yetersiz olup olmadığı ve ağ getirmesinin gerekli olup olmadığı.
uk: Живий контекст: чи недостатньо застарілих локальних фрагментів і чи потрібне отримання з мережі.
vi: Ngữ cảnh trực tiếp: liệu các đoạn cục bộ cũ có không đủ và cần tìm nạp qua mạng hay không.
zh_hans: 实时上下文：本地分片是否不足以安全回答，必须联网补充。
zh_hant: 即時上下文：本地分片是否不足以安全回答，必須聯網補充。
